tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "rcmdnk/rcmdnkcask"
brew "docker"
brew "go"
brew "mas"
brew "the_platinum_searcher"
brew "tmux"
brew "tree"
cask "appcleaner"
cask "docker"
cask "font-migu1m"
cask "google-chrome"
cask "inkdrop"
cask "iterm2"
cask "multipass"
cask "onyx"
cask "spotify"
cask "visual-studio-code"
mas "1Password 7", id: 1333542190
mas "Alfred", id: 405843582
mas "feedly", id: 865500966
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PopClip", id: 445189367
